Raw-wrk-files/run-3/query/spring/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Mon Oct 21 20:50:23 PDT 2013

  System load:  0.61               Processes:           120
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 3%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

64 packages can be updated.
24 updates are security updates.


---------------------------------------------------------
 Running Primer spring
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/spring/db?queries=2
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/spring/db?queries=2
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  239.53us   7.35ms   89.28%
    Req/Sec     1.11k   104.05     1.44k    54.18%
  41813 requests in 5.00s, 8.60MB read
Requests/sec:   8361.84
Transfer/sec:      1.72MB

---------------------------------------------------------
 Running Warmup spring
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/spring/db?queries=2
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/spring/db?queries=2
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.53ms   66.54ms 712.25ms   98.94%
    Req/Sec     3.00k   669.14     6.70k    83.50%
  341352 requests in 15.00s, 70.17MB read
Requests/sec:  22756.81
Transfer/sec:      4.68MB

---------------------------------------------------------
 Queries: 1 for spring
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/spring/db?queries=1
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/spring/db?queries=1
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.26ms   10.99ms 176.14ms   94.24%
    Req/Sec     4.00k   831.68     9.94k    78.66%
  466730 requests in 15.00s, 81.80MB read
Requests/sec:  31115.37
Transfer/sec:      5.45MB

---------------------------------------------------------
 Queries: 5 for spring
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/spring/db?queries=5
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/spring/db?queries=5
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.79ms    9.17ms 196.84ms   80.13%
    Req/Sec     1.63k   167.12     2.64k    81.05%
  193098 requests in 15.00s, 57.25MB read
Requests/sec:  12872.76
Transfer/sec:      3.82MB

---------------------------------------------------------
 Queries: 10 for spring
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/spring/db?queries=10
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/spring/db?queries=10
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.51ms   11.44ms 204.44ms   80.17%
    Req/Sec     0.95k    93.94     1.95k    81.48%
  112904 requests in 15.00s, 50.58MB read
Requests/sec:   7526.30
Transfer/sec:      3.37MB

---------------------------------------------------------
 Queries: 15 for spring
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/spring/db?queries=15
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/spring/db?queries=15
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.68ms   13.74ms 324.56ms   81.13%
    Req/Sec   668.68     48.14     0.95k    74.85%
  79898 requests in 15.01s, 47.90MB read
Requests/sec:   5323.77
Transfer/sec:      3.19MB

---------------------------------------------------------
 Queries: 20 for spring
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/spring/db?queries=20
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/spring/db?queries=20
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    61.54ms   15.93ms 238.88ms   82.33%
    Req/Sec   517.65     33.25   753.00     74.86%
  61853 requests in 15.00s, 46.46MB read
Requests/sec:   4122.64
Transfer/sec:      3.10MB